import type { 六神 } from '../core/six-gods.js';
import type { 六爻卦 } from '../classes/hexagram.js';
import { 单爻 } from './json.js';
import { 动静状态 } from '../classes/yao.js';

function 单卦(卦: 六爻卦, gods?: 六神[]): string {
  const 上爻 = 单爻(卦, 5, gods);
  const 五爻 = 单爻(卦, 4, gods);
  const 四爻 = 单爻(卦, 3, gods);
  const 三爻 = 单爻(卦, 2, gods);
  const 二爻 = 单爻(卦, 1, gods);
  const 初爻 = 单爻(卦, 0, gods);

  return `${卦.动静状态 === 动静状态.动已变 ? '变' : '本'}卦:
  卦名: ${卦.卦名}
  宫: ${卦.宫位信息}
  六冲六合: ${卦.六冲六合 ?? '不是'}
  上爻:
    爻: ${上爻.爻}
    装卦: ${上爻.装卦}
    六神: ${上爻.六神}
    是否动爻: ${上爻.是否动爻}
  五爻:
    爻: ${五爻.爻}
    装卦: ${五爻.装卦}
    六神: ${五爻.六神}
    是否动爻: ${五爻.是否动爻}
  四爻:
    爻: ${四爻.爻}
    装卦: ${四爻.装卦}
    关系: ${四爻.关系 ?? ''}
    六神: ${四爻.六神}
    是否动爻: ${四爻.是否动爻}
  三爻:
    爻: ${三爻.爻}
    装卦: ${三爻.装卦}
    关系: ${三爻.关系 ?? ''}
    六神: ${三爻.六神}
    是否动爻: ${三爻.是否动爻}
  二爻:
    爻: ${二爻.爻}
    装卦: ${二爻.装卦}
    关系: ${二爻.关系 ?? ''}
    六神: ${二爻.六神}
    是否动爻: ${二爻.是否动爻}
  初爻:
    爻: ${初爻.爻}
    装卦: ${初爻.装卦}
    关系: ${初爻.关系 ?? ''}
    六神: ${初爻.六神}
    是否动爻: ${初爻.是否动爻}`;
}

/**
 * This output is meant for AI skills.
 */
export function toYAML(本卦: 六爻卦, gods?: 六神[]): string {
  const 变卦 = 本卦.变();
  return 变卦 !== 本卦 ? `${单卦(本卦, gods)}\n${单卦(变卦, gods)}` : 单卦(本卦, gods);
}
