export const 八宫卦位顺序表 = ['本宫卦', '一世卦', '二世卦', '三世卦', '四世卦', '五世卦', '游魂卦', '归魂卦'];

export type 地支五行 =
  | '子水'
  | '寅木'
  | '辰土'
  | '午火'
  | '申金'
  | '戌土'
  | '寅木'
  | '辰土'
  | '午火'
  | '申金'
  | '戌土'
  | '子水'
  | '辰土'
  | '午火'
  | '申金'
  | '戌土'
  | '子水'
  | '寅木'
  | '子水'
  | '寅木'
  | '辰土'
  | '午火'
  | '申金'
  | '戌土'
  | '丑土'
  | '亥水'
  | '酉金'
  | '未土'
  | '巳火'
  | '卯木'
  | '卯木'
  | '丑土'
  | '亥水'
  | '酉金'
  | '未土'
  | '巳火'
  | '未土'
  | '巳火'
  | '卯木'
  | '丑土'
  | '亥水'
  | '酉金'
  | '巳火'
  | '卯木'
  | '丑土'
  | '亥水'
  | '酉金'
  | '未土';

export type 五行 = '金' | '木' | '水' | '火' | '土';

export type 天干 = '甲' | '乙' | '丙' | '丁' | '戊' | '己' | '庚' | '辛' | '壬' | '癸';

export type 八卦名 = '乾' | '兑' | '离' | '震' | '巽' | '坎' | '艮' | '坤';

export interface 六爻卦象信息 {
  /**
   * Binary representation of the hexagram, where 0 image a yin line and 1 image a yang line. The lines are ordered from the bottom (first line) to the top (sixth line).
   */
  二进制表示: string;

  /**
   * Binary to yangs.
   * e.g. `'000000'` 坤为地 -> `[2, 2, 2, 2, 2, 2]`, 2 means Shao Yin.
   */
  阳数: number[];

  /**
   * Full name of the hexagram, which includes the names of the upper and lower trigrams.
   *
   * For example, "坤为地", "地雷复", "地水师", etc.
   */
  全名: string;

  /**
   * Name of the hexagram.
   *
   * For example, "地", "复", "师", etc.
   */
  卦名: string;

  /**
   * 64 hexagrams correspond to Unicode characters.
   * For example, "䷁" (U+4DC1) image the hexagram "坤为地".
   */
  符号: string;

  /**
   * Five Phases (五行) associated with the hexagram, which can be one of "金" (Metal), "木" (Wood), "水" (Water), "火" (Fire), or "土" (Earth).
   * It indicates the development and state of things.
   */
  五行: 五行;

  /**
   * Eight Palaces (八宫) to which the hexagram belongs.
   * 'Palace' is not a physical palace, but rather a category or family of hexagrams.
   */
  宫: 八卦名;

  /**
   * Index of the hexagram within its palace, ranging from 0 to 7. This index helps to identify the specific hexagram within the context of its palace.
   *
   * - 本宫卦 Original Palace
   * - 一世卦 First Generation, 1st yao is changed
   * - 二世卦 Second Generation, 1st and 2nd yao is changed
   * - 三世卦 Third Generation, 1st, 2nd and 3rd yao is changed
   * - 四世卦 Fourth Generation, 1st, 2nd, 3rd and 4th yao is changed
   * - 五世卦 Fifth Generation, 1st, 2nd, 3rd, 4th and 5th yao is changed
   * - 游魂卦 Wandering Soul, restores 4th yao of Fifth Generation
   * - 归魂卦 Returning Soul, restores lower 3 yaos of Fifth Generation
   */
  卦位: 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7;
}

export const 六爻卦象信息表: readonly 六爻卦象信息[] = [
  {
    二进制表示: '000000',
    全名: '坤为地',
    符号: '䷁',
    五行: '土',
    宫: '坤',
    卦位: 0,
    阳数: [2, 2, 2, 2, 2, 2],
    卦名: '坤',
  },
  {
    二进制表示: '100000',
    全名: '地雷复',
    符号: '䷗',
    五行: '土',
    宫: '坤',
    卦位: 1,
    阳数: [1, 2, 2, 2, 2, 2],
    卦名: '复',
  },
  {
    二进制表示: '010000',
    全名: '地水师',
    符号: '䷆',
    五行: '水',
    宫: '坎',
    卦位: 7,
    阳数: [2, 1, 2, 2, 2, 2],
    卦名: '师',
  },
  {
    二进制表示: '110000',
    全名: '地泽临',
    符号: '䷒',
    五行: '土',
    宫: '坤',
    卦位: 2,
    阳数: [1, 1, 2, 2, 2, 2],
    卦名: '临',
  },
  {
    二进制表示: '001000',
    全名: '地山谦',
    符号: '䷎',
    五行: '土',
    宫: '兑',
    卦位: 5,
    阳数: [2, 2, 1, 2, 2, 2],
    卦名: '谦',
  },
  {
    二进制表示: '101000',
    全名: '地火明夷',
    符号: '䷣',
    五行: '水',
    宫: '坎',
    卦位: 6,
    阳数: [1, 2, 1, 2, 2, 2],
    卦名: '明夷',
  },
  {
    二进制表示: '011000',
    全名: '地风升',
    符号: '䷭',
    五行: '木',
    宫: '震',
    卦位: 4,
    阳数: [2, 1, 1, 2, 2, 2],
    卦名: '升',
  },
  {
    二进制表示: '111000',
    全名: '地天泰',
    符号: '䷊',
    五行: '土',
    宫: '坤',
    卦位: 3,
    阳数: [1, 1, 1, 2, 2, 2],
    卦名: '泰',
  },
  {
    二进制表示: '000100',
    全名: '雷地豫',
    符号: '䷏',
    五行: '木',
    宫: '震',
    卦位: 1,
    阳数: [2, 2, 2, 1, 2, 2],
    卦名: '豫',
  },
  {
    二进制表示: '100100',
    全名: '震为雷',
    符号: '䷲',
    五行: '木',
    宫: '震',
    卦位: 0,
    阳数: [1, 2, 2, 1, 2, 2],
    卦名: '震',
  },
  {
    二进制表示: '010100',
    全名: '雷水解',
    符号: '䷧',
    五行: '木',
    宫: '震',
    卦位: 2,
    阳数: [2, 1, 2, 1, 2, 2],
    卦名: '解',
  },
  {
    二进制表示: '110100',
    全名: '雷泽归妹',
    符号: '䷵',
    五行: '金',
    宫: '兑',
    卦位: 7,
    阳数: [1, 1, 2, 1, 2, 2],
    卦名: '归妹',
  },
  {
    二进制表示: '001100',
    全名: '雷山小过',
    符号: '䷽',
    五行: '金',
    宫: '兑',
    卦位: 6,
    阳数: [2, 2, 1, 1, 2, 2],
    卦名: '小过',
  },
  {
    二进制表示: '101100',
    全名: '雷火丰',
    符号: '䷶',
    五行: '水',
    宫: '坎',
    卦位: 5,
    阳数: [1, 2, 1, 1, 2, 2],
    卦名: '丰',
  },
  {
    二进制表示: '011100',
    全名: '雷风恒',
    符号: '䷟',
    五行: '木',
    宫: '震',
    卦位: 3,
    阳数: [2, 1, 1, 1, 2, 2],
    卦名: '恒',
  },
  {
    二进制表示: '111100',
    全名: '雷天大壮',
    符号: '䷡',
    五行: '土',
    宫: '坤',
    卦位: 4,
    阳数: [1, 1, 1, 1, 2, 2],
    卦名: '大壮',
  },
  {
    二进制表示: '000010',
    全名: '水地比',
    符号: '䷇',
    五行: '土',
    宫: '坤',
    卦位: 7,
    阳数: [2, 2, 2, 2, 1, 2],
    卦名: '比',
  },
  {
    二进制表示: '100010',
    全名: '水雷屯',
    符号: '䷂',
    五行: '水',
    宫: '坎',
    卦位: 2,
    阳数: [1, 2, 2, 2, 1, 2],
    卦名: '屯',
  },
  {
    二进制表示: '010010',
    全名: '坎为水',
    符号: '䷜',
    五行: '水',
    宫: '坎',
    卦位: 0,
    阳数: [2, 1, 2, 2, 1, 2],
    卦名: '坎',
  },
  {
    二进制表示: '110010',
    全名: '水泽节',
    符号: '䷻',
    五行: '水',
    宫: '坎',
    卦位: 1,
    阳数: [1, 1, 2, 2, 1, 2],
    卦名: '节',
  },
  {
    二进制表示: '001010',
    全名: '水山蹇',
    符号: '䷦',
    五行: '金',
    宫: '兑',
    卦位: 4,
    阳数: [2, 2, 1, 2, 1, 2],
    卦名: '蹇',
  },
  {
    二进制表示: '101010',
    全名: '水火既济',
    符号: '䷾',
    五行: '水',
    宫: '坎',
    卦位: 3,
    阳数: [1, 2, 1, 2, 1, 2],
    卦名: '既济',
  },
  {
    二进制表示: '011010',
    全名: '水风井',
    符号: '䷯',
    五行: '木',
    宫: '震',
    卦位: 5,
    阳数: [2, 1, 1, 2, 1, 2],
    卦名: '井',
  },
  {
    二进制表示: '111010',
    全名: '水天需',
    符号: '䷄',
    五行: '土',
    宫: '坤',
    卦位: 6,
    阳数: [1, 1, 1, 2, 1, 2],
    卦名: '需',
  },
  {
    二进制表示: '000110',
    全名: '泽地萃',
    符号: '䷬',
    五行: '金',
    宫: '兑',
    卦位: 2,
    阳数: [2, 2, 2, 1, 1, 2],
    卦名: '萃',
  },
  {
    二进制表示: '100110',
    全名: '泽雷随',
    符号: '䷐',
    五行: '木',
    宫: '震',
    卦位: 7,
    阳数: [1, 2, 2, 1, 1, 2],
    卦名: '随',
  },
  {
    二进制表示: '010110',
    全名: '泽水困',
    符号: '䷮',
    五行: '金',
    宫: '兑',
    卦位: 1,
    阳数: [2, 1, 2, 1, 1, 2],
    卦名: '困',
  },
  {
    二进制表示: '110110',
    全名: '兑为泽',
    符号: '䷹',
    五行: '金',
    宫: '兑',
    卦位: 0,
    阳数: [1, 1, 2, 1, 1, 2],
    卦名: '兑',
  },
  {
    二进制表示: '001110',
    全名: '泽山咸',
    符号: '䷞',
    五行: '金',
    宫: '兑',
    卦位: 3,
    阳数: [2, 2, 1, 1, 1, 2],
    卦名: '咸',
  },
  {
    二进制表示: '101110',
    全名: '泽火革',
    符号: '䷰',
    五行: '水',
    宫: '坎',
    卦位: 4,
    阳数: [1, 2, 1, 1, 1, 2],
    卦名: '革',
  },
  {
    二进制表示: '011110',
    全名: '泽风大过',
    符号: '䷛',
    五行: '木',
    宫: '震',
    卦位: 6,
    阳数: [2, 1, 1, 1, 1, 2],
    卦名: '大过',
  },
  {
    二进制表示: '111110',
    全名: '泽天夬',
    符号: '䷪',
    五行: '土',
    宫: '坤',
    卦位: 5,
    阳数: [1, 1, 1, 1, 1, 2],
    卦名: '夬',
  },
  {
    二进制表示: '000001',
    全名: '山地剥',
    符号: '䷖',
    五行: '金',
    宫: '乾',
    卦位: 5,
    阳数: [2, 2, 2, 2, 2, 1],
    卦名: '剥',
  },
  {
    二进制表示: '100001',
    全名: '山雷颐',
    符号: '䷚',
    五行: '木',
    宫: '巽',
    卦位: 6,
    阳数: [1, 2, 2, 2, 2, 1],
    卦名: '颐',
  },
  {
    二进制表示: '010001',
    全名: '山水蒙',
    符号: '䷃',
    五行: '火',
    宫: '离',
    卦位: 4,
    阳数: [2, 1, 2, 2, 2, 1],
    卦名: '蒙',
  },
  {
    二进制表示: '110001',
    全名: '山泽损',
    符号: '䷨',
    五行: '土',
    宫: '艮',
    卦位: 3,
    阳数: [1, 1, 2, 2, 2, 1],
    卦名: '损',
  },
  {
    二进制表示: '001001',
    全名: '艮为山',
    符号: '䷳',
    五行: '土',
    宫: '艮',
    卦位: 0,
    阳数: [2, 2, 1, 2, 2, 1],
    卦名: '艮',
  },
  {
    二进制表示: '101001',
    全名: '山火贲',
    符号: '䷕',
    五行: '土',
    宫: '艮',
    卦位: 1,
    阳数: [1, 2, 1, 2, 2, 1],
    卦名: '贲',
  },
  {
    二进制表示: '011001',
    全名: '山风蛊',
    符号: '䷑',
    五行: '木',
    宫: '巽',
    卦位: 7,
    阳数: [2, 1, 1, 2, 2, 1],
    卦名: '蛊',
  },
  {
    二进制表示: '111001',
    全名: '山天大畜',
    符号: '䷙',
    五行: '土',
    宫: '艮',
    卦位: 2,
    阳数: [1, 1, 1, 2, 2, 1],
    卦名: '大畜',
  },
  {
    二进制表示: '000101',
    全名: '火地晋',
    符号: '䷢',
    五行: '金',
    宫: '乾',
    卦位: 6,
    阳数: [2, 2, 2, 1, 2, 1],
    卦名: '晋',
  },
  {
    二进制表示: '100101',
    全名: '火雷噬嗑',
    符号: '䷔',
    五行: '木',
    宫: '巽',
    卦位: 5,
    阳数: [1, 2, 2, 1, 2, 1],
    卦名: '噬嗑',
  },
  {
    二进制表示: '010101',
    全名: '火水未济',
    符号: '䷿',
    五行: '火',
    宫: '离',
    卦位: 3,
    阳数: [2, 1, 2, 1, 2, 1],
    卦名: '未济',
  },
  {
    二进制表示: '110101',
    全名: '火泽睽',
    符号: '䷥',
    五行: '土',
    宫: '艮',
    卦位: 4,
    阳数: [1, 1, 2, 1, 2, 1],
    卦名: '睽',
  },
  {
    二进制表示: '001101',
    全名: '火山旅',
    符号: '䷷',
    五行: '火',
    宫: '离',
    卦位: 1,
    阳数: [2, 2, 1, 1, 2, 1],
    卦名: '旅',
  },
  {
    二进制表示: '101101',
    全名: '离为火',
    符号: '䷝',
    五行: '火',
    宫: '离',
    卦位: 0,
    阳数: [1, 2, 1, 1, 2, 1],
    卦名: '离',
  },
  {
    二进制表示: '011101',
    全名: '火风鼎',
    符号: '䷱',
    五行: '火',
    宫: '离',
    卦位: 2,
    阳数: [2, 1, 1, 1, 2, 1],
    卦名: '鼎',
  },
  {
    二进制表示: '111101',
    全名: '火天大有',
    符号: '䷍',
    五行: '金',
    宫: '乾',
    卦位: 7,
    阳数: [1, 1, 1, 1, 2, 1],
    卦名: '大有',
  },
  {
    二进制表示: '000011',
    全名: '风地观',
    符号: '䷓',
    五行: '金',
    宫: '乾',
    卦位: 4,
    阳数: [2, 2, 2, 2, 1, 1],
    卦名: '观',
  },
  {
    二进制表示: '100011',
    全名: '风雷益',
    符号: '䷩',
    五行: '木',
    宫: '巽',
    卦位: 3,
    阳数: [1, 2, 2, 2, 1, 1],
    卦名: '益',
  },
  {
    二进制表示: '010011',
    全名: '风水涣',
    符号: '䷺',
    五行: '火',
    宫: '离',
    卦位: 5,
    阳数: [2, 1, 2, 2, 1, 1],
    卦名: '涣',
  },
  {
    二进制表示: '110011',
    全名: '风泽中孚',
    符号: '䷼',
    五行: '土',
    宫: '艮',
    卦位: 6,
    阳数: [1, 1, 2, 2, 1, 1],
    卦名: '中孚',
  },
  {
    二进制表示: '001011',
    全名: '风山渐',
    符号: '䷴',
    五行: '土',
    宫: '艮',
    卦位: 7,
    阳数: [2, 2, 1, 2, 1, 1],
    卦名: '渐',
  },
  {
    二进制表示: '101011',
    全名: '风火家人',
    符号: '䷤',
    五行: '木',
    宫: '巽',
    卦位: 2,
    阳数: [1, 2, 1, 2, 1, 1],
    卦名: '家人',
  },
  {
    二进制表示: '011011',
    全名: '巽为风',
    符号: '䷸',
    五行: '木',
    宫: '巽',
    卦位: 0,
    阳数: [2, 1, 1, 2, 1, 1],
    卦名: '巽',
  },
  {
    二进制表示: '111011',
    全名: '风天小畜',
    符号: '䷈',
    五行: '木',
    宫: '巽',
    卦位: 1,
    阳数: [1, 1, 1, 2, 1, 1],
    卦名: '小畜',
  },
  {
    二进制表示: '000111',
    全名: '天地否',
    符号: '䷋',
    五行: '金',
    宫: '乾',
    卦位: 3,
    阳数: [2, 2, 2, 1, 1, 1],
    卦名: '否',
  },
  {
    二进制表示: '100111',
    全名: '天雷无妄',
    符号: '䷘',
    五行: '木',
    宫: '巽',
    卦位: 4,
    阳数: [1, 2, 2, 1, 1, 1],
    卦名: '无妄',
  },
  {
    二进制表示: '010111',
    全名: '天水讼',
    符号: '䷅',
    五行: '火',
    宫: '离',
    卦位: 6,
    阳数: [2, 1, 2, 1, 1, 1],
    卦名: '讼',
  },
  {
    二进制表示: '110111',
    全名: '天泽履',
    符号: '䷉',
    五行: '土',
    宫: '艮',
    卦位: 5,
    阳数: [1, 1, 2, 1, 1, 1],
    卦名: '履',
  },
  {
    二进制表示: '001111',
    全名: '天山遁',
    符号: '䷠',
    五行: '金',
    宫: '乾',
    卦位: 2,
    阳数: [2, 2, 1, 1, 1, 1],
    卦名: '遁',
  },
  {
    二进制表示: '101111',
    全名: '天火同人',
    符号: '䷌',
    五行: '火',
    宫: '离',
    卦位: 7,
    阳数: [1, 2, 1, 1, 1, 1],
    卦名: '同人',
  },
  {
    二进制表示: '011111',
    全名: '天风姤',
    符号: '䷫',
    五行: '金',
    宫: '乾',
    卦位: 1,
    阳数: [2, 1, 1, 1, 1, 1],
    卦名: '姤',
  },
  {
    二进制表示: '111111',
    全名: '乾为天',
    符号: '䷀',
    五行: '金',
    宫: '乾',
    卦位: 0,
    阳数: [1, 1, 1, 1, 1, 1],
    卦名: '乾',
  },
];

export interface 八卦信息 {
  /**
   * Presents the trigram as a 3-digit binary string. 1 image a Yang line and 0 image a Yin line.
   *
   * For example, "111" for 乾, "100" for 震, etc.
   */
  二进制表示: `${0 | 1}${0 | 1}${0 | 1}`;

  /**
   * How many Yang Yaos are in the trigram, such as 0 for 坤, 1 for 震, 2 for 兑, etc.
   */
  阳数: 0 | 1 | 2 | 3;

  /**
   * Name of the trigram in Chinese, such as "乾", "坤", "震", etc.
   */
  卦名: string;

  /**
   * "象", means what the trigram represents in Chinese, such as "天", "地", "水", etc.
   */
  象: string;

  /**
   * Unicode character representing the trigram, such as "☰" for 乾, "☷" for 坤, etc.
   */
  符号: string;

  /**
   * Earth Stem and Five Phases when this gram performs a inner gram of a hexagram.
   * @see 《增删卜易·浑天甲子章》
   */
  作为内卦: 地支五行[];

  /**
   * Earth Stem and Five Phases when this gram performs a outer gram of a hexagram.
   * @see 《增删卜易·浑天甲子章》
   */
  作为外卦: 地支五行[];
}

/**
 * List of all trigrams in the I Ching, with their binary representation, number of yang lines, name, what they represent, and their corresponding sign.
 */
export const 八卦信息表: readonly 八卦信息[] = [
  {
    卦名: '坤',
    二进制表示: '000',
    阳数: 0,
    象: '地',
    符号: '☷',
    作为内卦: ['未土', '巳火', '卯木'],
    作为外卦: ['丑土', '亥水', '酉金'],
  },
  {
    卦名: '震',
    二进制表示: '100',
    阳数: 1,
    象: '雷',
    符号: '☳',
    作为内卦: ['子水', '寅木', '辰土'],
    作为外卦: ['午火', '申金', '戌土'],
  },
  {
    卦名: '坎',
    二进制表示: '010',
    阳数: 1,
    象: '水',
    符号: '☵',
    作为内卦: ['寅木', '辰土', '午火'],
    作为外卦: ['申金', '戌土', '子水'],
  },
  {
    卦名: '兑',
    二进制表示: '110',
    阳数: 2,
    象: '泽',
    符号: '☱',
    作为内卦: ['巳火', '卯木', '丑土'],
    作为外卦: ['亥水', '酉金', '未土'],
  },
  {
    卦名: '艮',
    二进制表示: '001',
    阳数: 1,
    象: '山',
    符号: '☶',
    作为内卦: ['辰土', '午火', '申金'],
    作为外卦: ['戌土', '子水', '寅木'],
  },
  {
    卦名: '离',
    二进制表示: '101',
    阳数: 2,
    象: '火',
    符号: '☲',
    作为内卦: ['卯木', '丑土', '亥水'],
    作为外卦: ['酉金', '未土', '巳火'],
  },
  {
    卦名: '巽',
    二进制表示: '011',
    阳数: 2,
    象: '风',
    符号: '☴',
    作为内卦: ['丑土', '亥水', '酉金'],
    作为外卦: ['未土', '巳火', '卯木'],
  },
  {
    卦名: '乾',
    二进制表示: '111',
    阳数: 3,
    象: '天',
    符号: '☰',
    作为内卦: ['子水', '寅木', '辰土'],
    作为外卦: ['午火', '申金', '戌土'],
  },
];

Object.freeze(八宫卦位顺序表);
Object.freeze(六爻卦象信息表);
Object.freeze(八卦信息表);
